import React from 'react';
import { Row, Col, Divider } from 'antd';
import '../public_scss/_cpt.scss';

const Digitalcpt = () => {
    const data = [
        "复旦大学附属华山医院",
        "复旦大学附属中山医院",
        "复旦大学附属华东医院",
        "复旦大学附属肿瘤医院",
        "复旦大学附属眼耳鼻喉科医院",
        "复旦大学附属妇产科医院",
        "复旦大学附属金山医院",
        "中国福利会国际和平妇幼保健院",
        "上海市普陀区中心医院",
        "上海交通大学附属瑞金医院",
        "上海交通大学附属新华医院",
        "上海交通大学附属第九人民医院",
        "同济大学附属同济医院",
        "同济大学附属东方医院",
        "同济大学附属肺科医院",
        "同济大学附属第十人民医院",
        "上海中医药大学附属龙华医院",
        "上海市第一妇婴保健院",
        "山东大学齐鲁医院",
        "山东千佛山医院",
        "山东省立医院",
        "青岛大学医学院附属医院",
        "山东省青岛市立医院",
        "山东省肿瘤医院",
        "新汶矿业集团中心医院",
        "山东东营市人民医院",
        "大连医学院附属第二医院",
        "大连医学院附属第一医院",
        "重庆医科大学第一附属医院",
        "重庆医科大学第二附属医院",
        "中山大学附属第三医院",
        "中山大学孙逸仙纪念医院",
        "广东药学院附属第一医院",
        "昆明医学院附属第一医院",
        "云南省肿瘤医院",
        "云南省玉溪市人民医院",
        "卫生部北京医院",
        "苏州大学附属第一医院",
        "江苏省南京市第一医院",
        "郑州大学第五附属医院",
        "河南省中医院",
        "河南科技大学第一附属医院",
        "安徽省立医院",
        "安徽医科大学第二附属医院",
        "皖南医学院附属弋矶山医院",
        "安徽省芜湖市第二人民医院",
        "安徽省马鞍山市人民医院",
        "浙江大学医学院附属第一医院",
        "浙江大学医学院附属第二医院",
        "浙江大学医学院附属妇产科医院",
        "浙江省肿瘤医院",
        "浙江省人民医院",
        "浙江省中医院",
        "浙江省台州市立医院",
        "浙江省湖州市妇幼保健院",
        "浙江省嘉兴市妇幼保健院",
        "四川省肿瘤医院",
        "四川省人民医院",
        "四川大学华西第二医院",
        "重庆医科大学附属儿童医院",
        "西安交通大学第一附属医院",
        "中山大学附属肿瘤医院",
        "重庆市涪陵中心医院",
        "深圳市第六人民医院",
        "昆明医学院附属第二医院",
        "重庆市肿瘤医院",
        "南昌大学第一附属医院",
        "辽宁省肿瘤医院",
        "重庆市南川区人民医院",
        "厦门大学附属第一医院",
        "新疆克拉玛依市中心医院",
        "兰州大学第二医院",
        "甘肃省人民医院",
        "兰州军区总医院",
        "兰州军区空军医院",
        "解放军第五医院（银川）",
        "江苏省常州市第一人民医院",
        "海南医科大学附属医院",
        "山东省潍坊市人民医院",
        "山东省交通医院",
        "中国医科大学附属第一医院",
        "郑州大学第三附属医院",
        "重庆市肿瘤医院",
        "云南省昆明市延安医院",
        "云南省蒙自市人民医院",
        "浙江省金华市中心医院",
        "浙江省绍兴市人民医院",
        "浙江省瑞安市人民医院",
        "浙江大学医学院附属邵逸夫医院",
        "上海长征医院",
        "上海市第五人民医院",
        "解放军181医院（桂林）",
        "海南省人民医院",
        "山东省交通医院",
        "中国医科大学附属第一医院",
        "安徽医科大学附属第一医院",
        "安徽省合肥市第二人民医院",
        "安徽省芜湖市第一人民医院",
        "河北省秦皇岛市第二人民医院",
        "河北工程大学附属医院",
        "浙江省台州医院",
    ]
    const data1 = [
        "华中科技大学同济医学院附属同济医院",
        "武汉大学中南医院",                               
        "武汉大学口腔医院",
        "解放军武汉总医院",                              
        "武汉亚洲心脏病医院",
        "十堰太和医院",                                    
        "十堰市人民医院",
        "鄂州市中心医院",                                 
        "解放军161医院",
        "武汉市中心医院",                              
        "武汉市普爱医院",
        "咸宁市中心医院",                               
        "荆州市中心医院",       
        "武汉科技大学附属天佑医院",        
        "长航总医院",
        "……",
    ]
    return (
        <React.Fragment>
            <div className='custom_cases'>
                <div className='case_title'>
                    <Divider orientation="left"><div className='title_self'>部分三甲医院客户：</div></Divider>
                </div>
                <Row>
                    {
                        data.map((i, index) => (
                            <Col lg={{ span: 8 }} sm={{ span: 12 }} xs={{ span: 24 }} key={index}>
                                <div className='custom_cases_item'>{i}</div>
                            </Col>
                        ))
                    }
                </Row>
            </div>
            <div className='custom_cases'>
                <div className='case_title'>
                    <Divider orientation="left"><div className='title_self'>湖北省部分医院客户：</div></Divider>
                </div>
                <Row>
                    {
                        data1.map((i, index) => (
                            <Col lg={{ span: 8 }} sm={{ span: 12 }} xs={{ span: 24 }} key={index}>
                                <div className='custom_cases_item'>{i}</div>
                            </Col>
                        ))
                    }
                </Row>
            </div>
        </React.Fragment>
    )
}

export default Digitalcpt;