import React from 'react';
import { Row, Col, Divider } from 'antd';
import '../public_scss/_cpt.scss';

const Recordcpt = () => {
    const data = [
        "复旦大学附属眼耳鼻喉科医院总院",
        "复旦大学附属眼耳鼻喉科医院浦江分院",
        "上海市质子重离子医院",
        "复旦大学附属华山医院",
        "上海市第七人民医院",
        "国际和平妇幼保健院",
        "上海市同济医院",
        "上海市普陀区中心医院",
        "上海市市东医院",
        "上海市安图医院",
        "上海市第一妇幼保健院",
        "合肥市第一人民医院",
        "合肥肿瘤医院",
        "宁国市人民医院 ",
        "泗县人民医院",
        "芜湖市第二人民医院",
        "芜湖中医院 ",
        "宿州市立医院",
        "宣城中心医院 ",
        "安徽省立医院",
        "安徽省中医院",
        "安医阜阳医院 ",
        "北京垂杨柳医院",
        "福州大学附属第一医院",
        "福建南平第一医院",
        "桂林解放军第一八一医院",
        "贵州妇幼/儿童医院",
        "铜仁市人民医院",
        "海南省人民医院",
        "定州市人民医院",
        "河北北方大学第一附属医院",
        "河北儿童医院",
        "河北工程大学附属医院",
        "河北邯郸中心医院",
        "新乡市第一人民医院",
        "丹江口第一医院",
        "汉川市人民医院",
        "建始县人民医院",
        "荆门市第一人民医院",
        "荆州市中心医院",
        "随州市中心医院",
        "武汉市第四医院",
        "武汉市三医院",
        "武汉市新洲区人民医院",
        "武汉市中西医结合医院",
        "武汉市中心医院",
        "孝昌县第一人民医院",
        "宜昌市第二人民院",
        "宜昌市葛洲坝中心医院",
        "南华大学附属第二医院",
        "南华大学附属第一医院",
        "中南大学湘雅三医院",
        "株洲市中心医院 ",
        "吉林大学白求恩第一附属医院",
        "江西省人民医院",
        "南昌二附院 ",
        "呼和浩特第一医院",
        "内蒙古民族大学附属医院",
        "汉中中心医院",
        "山西大医院 ",
        "山西儿童医院",
        "山西省心血管病医院",
        "成都军区总医院",
        "彭州市第四人民医院",
        "自贡市第四人民医院",
        "自贡市第一人民医院",
        "天津血液病研究所",
        "新疆大学第一附属医院  ",
        "昆明医科大学第二附属医院",
        "弥勒市中医院",
        "文山州人民医院",
        "云南普洱市人民医院",
        "涪陵中心医院",
        "重庆第二附属医院 ",
        "重庆儿童医院",
        "重庆南川人民医院",
        "重庆市荣昌区人民医院",
        "山东大学齐鲁医院",
        "山东省千佛山医院",
        "山东省肿瘤医院",
        "山东省立三院",
        "山东大学第二医院",
        "青岛市立医院",
        "青岛大学附属医院",
        "青岛眼科医院",
        "北大医疗鲁中医院(原齐鲁石化中心医院)",
        "临淄区人民医院",
        "淄博市淄川区医院",
        "桓台县人民医院",
        "东营市人民医院",
        "广饶县人民医院",
        "邹平县人民医院",
        "莱州市中医院",
        "泰山医学院附属医院",
        "新泰市第二人民医院",
        "威海中医院",
        "日照市中医院",
        "日照市人民医院",
        "日照市岚山区人民医院",
        "禹城市人民医院",
        "高密市人民医院",
        "……",
    ]
    return (
        <div className='custom_cases'>
            <div className='case_title'>
                <Divider orientation="left"><div className='title_self'>部分医院客户：</div></Divider>
            </div>
            <Row>
                {
                    data.map((i, index) => (
                        <Col lg={{ span: 8 }} sm={{ span: 12 }} xs={{ span: 24 }} key={index}>
                            <div className='custom_cases_item'>{i}</div>
                        </Col>
                    ))
                }
            </Row>
        </div>
    )
}

export default Recordcpt;